Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སྤྲུལ་པའི་སྤྲིན་སྒྲ་སྙན་པའི་དཔལ་མངའ་དང་། །སངས་རྒྱས་ཕྱོགས་ཀུན་གཟི་བརྗིད་དང་། །ཆོས་ཀྱི་རྒྱ་མཚོ་ཡོངས་བྱུང་སྒྲ་དབྱངས་དང་། །ཡོན་ཏན་རྒྱ་མཚོ་དཔལ་གྱི་སྒྲོན། །རྒྱལ་བའི་ཉི་མ་དགུ་པ་བྱུང་བར་གྱུར། །
en: Then there were the Buddha Gagana­citta, The Buddha Susaṃbhava­vyūha, Garjita­dharma­sāgara­nirghoṣa, {81} “The Jina Dharma­dhātu­svara­ghoṣa, Nirmita­megha­susvara­śrī, The Buddha Samanta­diśa­tejas, And Dharma­samudra­saṃbhava­ruta, {82} “Then there was the ninth of the jina suns, Guṇa­sāgara­śrī­pradīpa.

source: དེ་དག་ཀུན་གྱི་ཐ་མ་སྟེ། །རིན་ཆེན་དཔལ་སྒྲོན་ཡོན་ཏན་དཔལ་མཆོད་དོ། །
en: Following those there came Ratna­śrī­pradīpa­guṇa­ketu.

source: རིན་ཆེན་དཔལ་སྒྲོན་ཡོན་ཏན་དཔལ། །རྐང་གཉིས་དམ་པ་བྱུང་བར་གྱུར་པའི་ཚེ། །ཁོ་མོ་ལྷ་མོ་ཟླ་བཞིན་ཏེ། །མི་ཡི་དམ་པ་བྱུང་ཚེ་མཆོད་པ་བྱས། །རྒྱལ་བ་དེས་ནི་ཁོ་མོ་ལ། །
en: {83} “When Ratna­śrī­pradīpa­guṇa­ketu, The lord of two-legged beings, set forth, I was the goddess Śaśivakra, And I made offerings to the lord of humans as he set forth.

source: མདོ་སྡེ་སྨོན་ལམ་རྒྱ་མཚོ་འབྱུང་བའི་རྒྱན། །གནས་མེད་རྒྱན་ཀྱང་རབ་ཏུ་བཤད། །ཐོས་ནས་ཁོ་མོས་དྲན་པའི་སྟོབས་ཀྱིས་བཟུང་། །
en: {84} “That jina proclaimed to me Sūtras that were displays without location, Displays that arose from an ocean of prayers, Which I heard and retained through the power of memory.

source: ཁོ་མོས་མིག་ཡངས་དེར་ཐོབ་སྟེ། །ཏིངའཛིན་ཞི་དང་གཟུངས་ཀྱི་སྟོབས་ཀྱང་ཐོབ། །
en: {85} “I attained at that time vast vision, Samādhis, and the power of retention.

source: སྐད་ཅིག་རེ་རེ་ཞིང་བརྒྱུད་པའི། །རྒྱལ་བ་རྒྱ་མཚོ་མང་པོའང་ཁོ་མོས་མཐོང་། །
en: In each instant I saw oceans of jinas And a succession of realms.

source: བྱམས་ཚུལ་ཀུན་ཏུ་སྣང་བའི་སྤྲིན། །བྱང་ཆུབ་སེམས་རབ་མཁའ་དང་མཉམ་པ་སྟེ། །སྙིང་རྗེའི་སྙིང་པོས་བརྒྱན་པ་ཡང་། །སངས་རྒྱས་སྟོབས་ཀྱི་ཚུལ་དུ་ཡངས་པར་སྐྱེས། །
en: {86} “There arose in me the essence of compassion, The completely illuminating clouds of the way of kindness, The aspiration to enlightenment, as vast as space, And the vast beauty of the immeasurable buddha strengths.

source: འགྲོ་བ་ཕྱིན་ཅི་ལོག་གྱུར་ཏེ། །རྟག་དང་བདེ་དང་གཙང་དང་བདག་ཞེན་པ། །གཏི་མུག་མདོངས་གྱུར་མ་རིག་བསྒྲིབས། །
en: {87} “I saw beings who were in a state of delusion, Attached to permanence, happiness, purity, and self, Blinded by stupidity, obscured by ignorance, Disturbed by the kleśas, and having misperceptions.

source: ཉོན་མོངས་འཁྲུགས་ཤིང་ལོག་པར་འདུ་ཤེས་པ། །ལྟ་བའི་རྣམ་པར་སྟུག་ལ་སྤྱོད། །ལམ་གྱི་འགྲོ་རྒྱུད་ཉམ་ངར་སྲེད་དབང་གྱུར། །
en: {88} “They performed actions in a thicket of wrong views, Following frightening paths under the power of craving.

source: རྣམ་པ་སྣ་ཚོགས་བྱེ་བྲག་ཏུ། །ལས་ཀྱིས་རྣམ་པར་བྲིས་པས་ཀུན་བྱུང་བ། །
en: Many various forms appearing Were painted by karma.

source: འགྲོ་རྒྱུད་ཀུན་གྱི་ཤི་འཕོའི་སྒོར། །སྐྱེ་བར་འགྱུར་བས་ཀུན་ཏུ་སྐྱེར་འགྱུར་ཅིང་། །སྐྱེ་དང་རྒ་ཤི་གནོད་པ་རྣམས། །ལུས་དང་སེམས་ཀྱི་ཉམས་སུ་མྱོང་གྱུར་པ། །
en: {89} “Those who appeared through being born Through the gateways to rebirth in all existences Had bodies and minds that experienced The torments of birth, aging, and death.

source: མཐོང་ནས་དེ་དག་ཕན་བདེའི་ཕྱིར། །ཞིང་རྣམས་འབྱམ་ཀླས་ཐམས་ཅད་ཀྱི། །སྟོབས་བཅུ་གང་ལས་བྱུང་བ་ཡི། །བླ་ན་མེད་པའི་སེམས་ཀྱང་ཁོ་མོས་བསྐྱེད། །
en: {90} “Seeing that, in order to bring them benefit and happiness I developed the supreme motivation Wherever those with the ten strengths appeared, Anywhere throughout the vast extent of realms.

source: དེ་ལས་སྨོན་ལམ་སྤྲིན་བྱུང་བ། །འགྲོ་བ་ཀུན་ལ་བདེ་བར་གཞོལ་བའི་མཆོག །ཚོགས་རྣམས་འབྱུང་བ་མཐའ་ཡས་དང་། །ལམ་ཚུལ་རྒྱ་མཚོ་རྟོགས་པའང་དེ་ནས་བྱུང་། །
en: {91} “From that arose clouds of prayers, Perfect dedication to the happiness of beings, The arising of limitless accumulations, And the understanding of the ways of an ocean of paths.

source: འཇུག་པའི་སྤྲིན་ཡངས་ཐོབ་གྱུར་པ། །ལམ་ཆུད་ཀུན་ཏུ་སྒོ་གསལ་ཤུགས་ལྡན་ཏེ། །ཕ་རོལ་ཕྱིན་གྱི་སྤྲིན་ཡངས་པའང་། །ཆོས་དབྱིངས་འབྱམ་ཀླས་ཀུན་ཏུ་རྣམ་པར་འབྱེད། །
en: {92} “I obtained vast clouds of practices, The power of clear gateways to all paths, Vast clouds of the perfections, And the opening of the entire extent of the realm of Dharma.

source: ས་གནོན་ཤུགས་དྲག་ཡངས་ལྡན་དང་། །དུས་གསུམ་རྒྱ་མཚོའི་ཚུལ་གྱི་ས་རྣམས་ལ། །ཆགས་པ་མེད་པར་སྤྱོད་པར་གྱུར། །སྐད་ཅིག་གཅིག་གིས་རྒྱལ་བ་ཀུན་དྲུང་འགྲོ། །
en: {93} “With the vast power to ascend the bhūmis, Practicing without attachment on the bhūmis, In the ways of the ocean of the three times, In each instant I came into the presence of all jinas.

source: གཞན་ཡང་རྒྱལ་སྲས་ཁོ་མོས་ནི། །སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོ་ཡོངས་སུ་ནོན། །ཆོས་དབྱིངས་བྱེ་བྲག་བཅུ་རྣམས་ཀྱི། རྒྱ་མཚོའི་ཚུལ་ལའང་ཁོ་མོ་རྟོགས་པར་འཇུག །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: {94} “What is more, I also mastered The completely good jinaputra conduct, And I realized the ways of the ocean Of the ten aspects of the realm of the Dharma.

source: དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ། སངས་རྒྱས་ཀྱི་རིགས་ཀྱི་རྒྱུན་མི་གཅོད་པ་ལ་ཞུགས་པ། མིའི་བདག་པོ་ཞེས་བྱ་བ་བྱུང་བ། དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ནི།
en: {95} “Noble one, do you think that the cakravartin king, that sovereign, who at that time, in that time, was established in the unbroken lineage of the family of the buddhas is anyone else?

source: རིགས་ཀྱི་བུ་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Noble one, do not see him in that way.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མིའི་བདག་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བ་སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་གཅོད་པ་ལ་ཞུགས་པའོ། །
en: Mañjuśrī Kumāra­bhūta was at that time, in that time, that king, that sovereign, who was the cakravartin, established in the unbroken lineage of the family of the buddhas.

source: ཁོ་མོ་སད་པར་བྱེད་པའི་མཚན་མོའི་ལྷ་མོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་སྤྲུལ་པའོ། །
en: The night goddess who awoke me was an emanation of the bodhisattva Samanta­bhadra.

source: དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་བཙུན་མོ་བུད་མེད་རིན་པོ་ཆེ་བཟང་པོའི་བློ་གྲོས་མ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that Bhadramati, the precious woman who was the queen of the cakravartin in that time, at that time, was anyone else, do not see her in that way.

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། འཁོར་ལོས་སྒྱུར་བའི་བཙུན་མོ་བུད་མེད་རིན་པོ་ཆེ་བཟང་པོའི་བློ་གྲོས་མ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: At that time, in that time, I was Bhadramati, the precious woman who was the queen of the cakravartin.

source: ཁོ་མོ་མཚན་མོའི་ལྷ་མོ་དེས་སད་པར་བྱས་ནས། སངས་རྒྱས་བལྟ་བ་ལ་ཡང་དག་པར་བསྐུལ་ཏོ། །
en: I was awoken by that night goddess and inspired by her to go see the Buddha.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་དེ་སྲིད་ཅིག་ནས་བསྐྱེད་དེ།
en: “Noble one, I developed in that one existence the aspiration for the highest, complete enlightenment.

source: དེ་ལྟར་ཁོ་མོ་སེམས་བསྐྱེད་པ་དེའི་མཐུས། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མ་སྐྱེས་ཏེ། རྟག་ཏུ་རྒྱུན་མ་འཆད་པར་ལྷ་དང་མིའི་འགྲོ་བའི་རྒྱུད་ལ་རྟེན་ཅིང་། ཐམས་ཅད་དུའང་དེ་བཞིན་གཤེགས་པ་བལྟ་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: In that way, through the power of that development of aspiration, I have, throughout kalpas as numerous as the atoms in a buddha realm, never fallen into rebirth in the lower realms but have always continuously depended on existence as a human or deva, and in all those existences I have seen tathāgatas.

source: ཐ་མར་ཁོ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་དཔལ་གྱི་སྒྲོལ་མ་ཡོན་ཏན་རྒྱལ་མཚན་མཐོང་བ་ཙམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཤིན་ཏུ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་འདི་ཐོབ་སྟེ།
en: Finally, through just seeing the Bhagavat Arhat Samyak­saṃbuddha Ratna­śrī­pradīpa­guṇa­ketu, I attained the bodhisattva liberation called the banner of the powerof vast, stainless, completely good joy.

source: དེ་ཐོབ་པས་ཁོ་མོ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་རྣམ་པ་འདི་ལྟ་བུས་སྟ་གོན་དུ་གནས་པ་ཡིན་ནོ། །
en: When I had attained it, I took on this kind of form in order to ripen and guide beings.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་རྒྱ་ཆེན་པོའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འཁོད་ཅིང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པའི་ཤུགས་དྲག་པོ་རྒྱ་མཚོ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ། འཇུག་པའི་སྒོ་ཐམས་ཅད་ལ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོས་འཇུག་པ། རབ་ཏུ་ཐོབ་པ། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ཕྱི་མའི་མཐའི་བསྐལ་པར་སྤྱད་པའི་དཀྱིལ་འཁོར་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ། སྤྱོད་པ་རེ་རེ་ལའང་ལུས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ།
en: “Noble one, I know only this bodhisattva liberation called the banner of the powerof vast, stainless, completely good joy.

source: ལུས་རེ་རེས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་ལ་མཁས་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་རེ་རེ་ལའང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་རྣམ་པར་དམིགས་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་ལ་མཁས་པ། ཞིང་ཐམས་ཅད་དུའང་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པར་མཁས་པ། དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་ཡང་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱས་པར་འགེངས་པའི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པར་མཁས་པ།
en: How could I know the conduct or describe the qualities of bodhisattvas who, at the feet of all the tathāgatas in each instant of mind, attain a great ocean of the power for setting out upon omniscience; who, in each instant of mind, have completed the attainment of an ocean of great prayers within all the entrances for setting out upon omniscience; who, in each instant of mind, are skilled, through the ways of making an ocean of prayers, in accomplishing a domain of conduct in future kalpas; who are skilled in accomplishing, within each conduct, as many bodies as there are atoms in all buddha realms; who are skilled in pervading, with each body, the entire ocean of different ways in the realm of phenomena; who are skilled in manifesting, in each ocean of different ways in the realm of phenomena, a perceivable conduct of the body that accords with the dispositions of beings throughout all the buddha realms; who are skilled in comprehending, in each ocean of different ways in the realm of phenomena, an ocean of tathāgatas, without limit or center, within all the atoms of a realm in all realms; who are skilled in comprehending each tathāgata’s miraculous tathāgata manifestations that pervade the entire extent of the realm of phenomena; who are skilled in comprehending each tathāgata’s accomplishment of gathering the accumulation of bodhisattva conduct in past kalpas; who are skilled in obtaining and possessing each tathāgata’s vast wheel of the Dharma; and who are skilled in comprehending the ocean of the different ways of miraculous manifestations by the tathāgatas in the three times?

source: དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྔོན་གྱི་མཐའི་བསྐལ་པ་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚོགས་ཡོངས་སུ་བསྒྲུབ་པ་ཡང་དག་པར་བསྡུས་པ་ལ་འཇུག་པར་མཁས་པ། དེ་བཞིན་གཤེགས་པ་རེ་རེའི་ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་ཡངས་པ། ཡང་དག་པར་བླང་བ་དང་། ཡོངས་སུ་གཟུང་བ་ལ་མཁས་པ། དུས་གསུམ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པར་མཁས་པ།
en: “Depart, noble one.

source: དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ཉིད་ན་ཁོ་མོ་དང་། རྒྱང་མི་རིང་བ་ཞིག་ན་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this circle of the Tathāgata’s assembly, not far from me, there is the goddess of the night named Samanta­sattva­trāṇojaḥ­śrī.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct?

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ལ་འཇུག་པར་བྱ་བ་དང་། ཇི་ལྟར་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དྲིས་ཤིག །
en: How should a bodhisattva practice it?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ལ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Pramudita­nayana­jagad­virocanā, circumambulated the night goddess Pramudita­nayana­jagad­virocanā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Pramudita­nayana­jagad­virocanā.

source: བམ་པོ་བདུན་པ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཤིན་ཏུ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་དེ་ལ་མོས་པར་བྱ་བ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། རྟོགས་པར་བྱ་བ་དང་། ཤེས་པར་བྱ་བ་དང་། ཡིད་ཆེས་པར་བྱ་བ་དང་། རབ་ཏུ་གཞོལ་བར་བྱ་བ་དང་། རྒྱས་པར་དགང་བར་བྱ་བ་དང་། རྗེས་སུ་ཤེས་པར་བྱ་བ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། རྗེས་སུ་གཞོལ་བར་བྱ་བ་དང་། བསྒོམ་པ་བྱེད་ཅིང་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནན་ཏན་དུ་བྱ་བ་དང་། གདམས་ངག་རྗེས་སུ་བསྟན་པ་ལ་བར་ཆད་མེད་པར་བྱ་བའི་ཕྱིར་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བས། འགྲོ་ཁར་གདམས་པ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་། དགེ་བའི་བཤེས་གཉེན་བལྟ་བའི་རྗེས་སུ་སེམས་པའི་དབང་པོའི་དཀྱིལ་འཁོར་དང་། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ཐོབ་པར་བྱ་བ་ལ་ཡང་དག་པར་སྤྱོད་པ། ཕྱོགས་ཀུན་ཏུ་མངོན་པར་ལྟས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་བཙལ་བར་ཡིད་ལ་བྱ་བ་དང་། ང་རྒྱལ་ཐམས་ཅད་དང་བྲལ་བ་དང་།
en: Samanta­sattva­trāṇojaḥ­śrī Chapter 37 Then Sudhana, the head merchant’s son, aspiring to the night goddess Pramudita­nayana­jagad­virocanā’s samādhi of the bodhisattva liberation called the banner of the powerof vast, stainless, completely good joy, comprehending it, understanding it, knowing it, believing in it, undertaking it, pervading it, recollecting it, remembering it, and meditating on it, practicing the instruction of the kalyāṇamitra and memorizing the instruction given by the night goddess Pramudita­nayana­jagad­virocanā in order to maintain the continuity of the teaching of instruction, approached the night goddess Samanta­sattva­trāṇojaḥ­śrī.

source: དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་མཐུ་ཚོགས་ཆེན་པོས་ཡོངས་སུ་བསྒྲུབ་པར་ཞེ་ནོན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་དང་། རྒྱུད་ཀྱི་ཚུལ་གཅིག་ཏུ་གྱུར་པའི་དགེ་བའི་རྩ་བས་དགེ་བའི་བཤེས་གཉེན་གྱི་ཐབས་མཁས་པའི་སྤྱོད་པ་ཐམས་ཅད་ལ་བསམ་པ་མི་ཕྱེད་པས་ཞུགས་པ། །དགེ་བའི་བཤེས་གཉེན་ལ་བརྟན་པ་ཡོངས་སུ་འཕེལ་བར་བྱ་བ་ལ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཆེན་པོ་རྒྱ་མཚོ་ཡོངས་སུ་སྐྱེས་པ། བསྐལ་པ་ཐམས་ཅད་དུ་དགེ་བའི་བཤེས་གཉེན་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པས་གནས་པར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་པ་དེ། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་དྲུང་དུ་སོང་ངོ་། །
en: Through contemplating seeing a kalyāṇamitra, through the domain of all his faculties, by going from place to place to obtain the sight of a kalyāṇamitra, through looking in all directions, through being intent on searching for a kalyāṇamitra, through being free from all pride, through the prowess of pleasing a kalyāṇamitra, through being resolved to create a great accumulation of merit, through having become single-mindedly intent upon a kalyāṇamitra, and through all his roots of merit, he had gained the unwavering motivation for a kalyāṇamitra’s conduct of skillful methods, had developed an ocean of the power of diligence for increasing reliance on a kalyāṇamitra, and had prayed to dwell with and follow kalyāṇamitras equally in all kalpas.

source: དེ་དེ་ལྟར་འགྲོ་བའི་ཚེ། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས་འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཡོངས་སུ་བསྟན་པའི་ཕྱིར། མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཡོངས་སུ་གྲུབ་པའི་ལུས་བསྟན་ཏེ།
en: As he approached her, the night goddess Samanta­sattva­trāṇojaḥ­śrī, in order to demonstrate the supreme might of the limitless bodhisattva liberation called the manifestations that guide beings that appear in all worlds, revealed her body, which had the complete beautiful signs and features of a great being.

source: མཛོད་སྤུ་ནས་འོད་ཟེར་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་སྣང་བ་དྲི་མ་མེད་པའི་མདངས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་འོད་ཟེར་གྱི་འཁོར་མཐའ་དང་དབུས་མེད་པ་དང་ལྡན་པ་བཀྱེའོ། །
en: She then radiated from her ūrṇā hair a ray of light called the banner of stainless light that is a lamp of the complete radiance of wisdom, accompanied by light rays without end or center.

source: དེས་འཇིག་རྟེན་ཐམས་ཅད་སྣང་བར་བྱས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོར་འདུས་ཏེ་ལུས་ཐམས་ཅད་དུ་ཁྱབ་པར་གྱུར་ཏོ། །
en: They illuminated all worlds and then descended into the crown of the head of Sudhana, the head merchant’s son, and spread throughout his entire body.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འོད་ཟེར་དེས་རེག་པར་གྱུར་མ་ཐག་ཏུ་དེ་ཉིད་ཀྱི་མོད་ལ་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བའི་དཀྱིལ་འཁོར་ཐོབ་པར་གྱུར་ཏོ། །དེ་ཐོབ་པས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་དང་།
en: As soon as Sudhana, the head merchant’s son, was touched by those light rays, he instantly attained the samādhi called the area that is completely free of particles.

source: མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ནས་སྐྱོང་བའི་གཟི་བརྗིད་ཀྱི་དཔལ་གཉིས་ཀྱི་བར་གྱི་ལམ་ན་སའི་དཀྱིལ་འཁོར་ཡོད་པ་དེ་ལ་མེའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ། ཆུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ། སའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ། རྡོ་རྗེའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དམ་པ་སྣ་ཚོགས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ། མེ་ཏོག་དང་། སྤོས་དང་། ཕྱེ་མའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ་རྒྱན་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: Because he had attained that, he saw the area of ground that was the route between the night goddess Pramudita­nayana­jagad­virocanā and the night goddess Samanta­sattva­trāṇojaḥ­śrī as being made of atoms of fire; or atoms of water; or atoms of earth; or atoms of diamond; or atoms of various great kings of precious jewels; or atoms of flowers, incense, and powders; or atoms of all precious arrays; or atoms of all locations.

source: དམིགས་པ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཅིག་ཡོད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དེ་དག་ཐམས་ཅད་ལ་རྡུལ་ཕྲ་མོ་རེ་རེ་ཞིང་ཡང་། འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད། ཆུའི་ཕུང་པོ་དང་བཅས། མེའི་ཕུང་པོ་དང་བཅས། རླུང་གི་ཕུང་པོ་དང་བཅས། སའི་ཕུང་པོ་དང་བཅས། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མཚམས་དང་བཅས། གཞི་དང་བཅས་རྟེན་དང་བཅས་པ་དབྱིབས་སྣ་ཚོགས་ཅན་སའི་གཞི་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དང་ལྡན་པའི་རིའི་འཁོར་སྣ་ཚོགས་ཅན།
en: In each atom there were world realms as numerous as the atoms in a buddha realm.

source: ཆུ་རླུང་དང་མཚོ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་རྒྱ་མཚོ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་འཁོར་བ། ལྷ་རྫས་ཀྱི་ཁྱིམ་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ། ཤིང་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ། ནམ་མཁའི་དབྱིངས་ཀྱི་རྒྱན་སྣ་ཚོགས་ཅན། ལྷའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ཀླུའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། གནོད་སྦྱིན་གྱི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། དྲི་ཟའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ལྷ་མ་ཡིན་གྱི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ནམ་མཁའ་ལྡིང་གི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། མིའམ་ཅིའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ལྟོ་འཕྱེ་ཆེན་པོའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། མིའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་ན་རྣམ་པར་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་གནས་དང་། སེམས་ཅན་དམྱལ་བའི་འཇིག་རྟེན་གྱི་ཡུལ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་འཇིག་རྟེན་གྱི་ཡུལ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ཡུལ་དང་། མི་དང་མི་མ་ཡིན་པའི་ལམ་གྱི་རྒྱུད་ཀྱི་ཤི་འཕོ་དང་། སྐྱེ་བའི་ཡུལ་དང་བཅས་པ། སྐྱེ་བ་སྣ་ཚོགས་ཀྱིས་མ་འདྲེས་པའི་རྒྱུད་མཐའ་ཡས་པའི་བྱེ་བྲག་ལ་ཡོངས་སུ་གཞོལ་བ་རྣམས་འདུ་ཞིང་འཇིག་པར་གྱུར་པ་མཐོང་ངོ་། །
en: He saw that they had aggregations of water, had aggregations of fire, had aggregations of air, had aggregations of earth, had world-realm boundaries, had bases, had foundations, had different shapes, had surfaces of various kinds of different forms, had different kinds of encircling mountains, had various kinds of encircling oceans, had arrays of various kinds of buildings made of divine materials, had various kinds of trees, had various adornments in the sky, had the adornment of the buildings of the cities of devas, had the adornment of the buildings of the cities of nāgas, had the adornment of the buildings of the cities of yakṣas, had the adornment of the buildings of the cities of gandharvas, had the adornment of the buildings of the cities of the asuras, had the adornment of the buildings of the cities of garuḍas, had the adornment of the buildings of the cities of kinnaras, had the adornment of the buildings of the cities of mahoragas, had the adornment of the buildings of the cities of humans, had the adornment of the buildings of the cities of all beings in the main and intermediate directions, had the realm of the world of hells, had the realm of the world of animals, had the realm of the world of Yama, had the realm of the death and rebirth of humans and nonhumans, had various kinds of births, and had the accumulation and destruction of various kinds of existences.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཀྱང་རྣམ་པ་སྣ་ཚོགས་སུ་མཐོང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ལམ་གྱི་རྒྱུད་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་རྣམ་པར་དག་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་གཞི་མཉམ་པར་མཐོང་ངོ་། །ལ་ལ་ནི་སྤྱིའུ་ཚུགས་སུ་གནས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་སྣྲེལ་ཞིར་འདུག་པར་མཐོང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་གྱི་ལམ་གྱི་རྒྱུད་དང་། སེམས་ཅན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་ན་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་སེམས་ཅན་སོ་སོ་ནས་འདུལ་བའི་རྐྱེན་བཞིན་དུ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མ་འདྲེས་པར་ཡོངས་སུ་བསྟན་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པར་གནས་པར་མཐོང་ངོ་། །སེམས་ཅན་ཚེའི་ཚད་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། མོས་པའི་སྤྱོད་ཡུལ་རྣམ་པ་སྣ་ཚོགས་ཅན་དང་།
en: He saw various kinds of differences between those worlds: he saw some worlds that were defiled, some that were pure, some that were completely defiled, some that were purified of ordinary existences, some that were purified of defilements, some that were both pure and defiled, some that were completely pure, some that were a flat surface, some that were upside-down, and some that were disordered, and he saw how in all the existences of beings, in all the births of beings in those world realms, the night goddess Samanta­sattva­trāṇojaḥ­śrī became present for all those beings in order to guide them according to their circumstances.

source: ལུས་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། ངག་རྣམ་པར་ཕྱེ་བ་དང་། ངེས་པའི་ཚིག་གི་འདུ་བྱེད་ཀྱི་ཐ་སྙད་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། སྦྱོར་བའི་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། དབང་གི་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་གདུལ་བའི་དོན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མ་འདྲེས་པར་མངོན་སུམ་དུ་གནས་པར་མཐོང་ངོ་། །དེ་ཡང་འདི་ལྟ་སྟེ། སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་དང་། འཇིག་པ་རྣམ་པར་བཟློག་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སྣ་ཚོགས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་གཅིག་ལ་གཅིག་ཟ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བཀྲེས་པ་དང་། སྐོམ་པ་ལ་སྩོགས་པའི་སྡུག་བསྔལ་གྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ཀླུའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཀླུའི་སྡུག་བསྔལ་དང་། འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་པའི་ཁམས་ཀྱི་སྡུག་བསྔལ་དང་། འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། མིའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་མཚན་མོའི་མུན་པ་མུན་ནག་གིས། ཆོད་པའི་མུན་པའི་འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། མི་སྙན་པ་དང་། བསྔགས་པའི་མ་ཡིན་པ་དང་། གྲགས་པ་མ་ཡིན་པའི་སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་ལ་མངོན་པར་ཞེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་གྲགས་པ་མ་ཡིན་པ་དང་།
en: He saw her becoming present separately for every being in order to ripen and guide them in accordance with their lifespans; the various scopes of their aspirations; the forms of their bodies; their languages, terminology, and established definitions; the forms of their practices; and their dominance.
